Autodesk.Revit.DB.Architecture.BoundarySegment.Curve
Get the curve that is formed by the element that defines the edge of this room.

Autodesk.Revit.DB.Architecture.BoundarySegment.Element
Retrieve the element that is responsible for producing this boundary segment.
Remarks: The element property is useful for finding all the elements that bound a specific room.

Autodesk.Revit.DB.Architecture.BoundarySegment.Document
Provides the document in which the element that created this segment resides.

Autodesk.Revit.DB.Architecture.BoundarySegment
An object that represents a segment of a room boundary.
Remarks: These objects define the exterior boundary of a room. The geometry of the
segment can be retrieved along with the element that is responsible for producing that
boundary.